public class Lesson8 {
    /**
     * Задание 8
     * Заполните n-мерный квадратный массив числами, которые увеличиваются на 1 по спирали (число n должно задаваться с клавиатуры).
     * Выведите результат на экран с соблюдением ширины столбцов. Для примера массив 4 на 4 должен
     * выглядеть как указано в примере.
     * Пример:
     * 1 2 3 4
     * 12 13 14 5
     * 11 16 15 6
     * 10 9 8 7
     * Дополнительно: выполнить задачу с использованием
     * только одного цикла + 1 балл.
     * @param args
     */
    public static void main(String[] args) {

    }
}
