public class Lesson12 {
    /**
     * Задание 12
     * Заполните квадратный массив размером n «ходом коня»
     * – (конь в шахматах ходит буквой «Г»). Существует простой
     * алгоритм, который позволяет гарантированно заполнить
     * доску ходом коня размерами от 5 до 70. Т. е. сначала заполните массив числом 0, а потом на первой клетке (элементе
     * массива) ставится число 1, на следующей, на которую прыгает конь – 2 и так до тех пор, пока не останется клеток, на
     * которые конь не ступал. Если остались нулевые значения
     * – значит алгоритм работает не верно. Выведите массив на
     * экран. Размерность массва должна задаваться с клавиатуры
     * @param args
     */
    public static void main(String[] args) {

    }
}
